# Рахманов Данила - “Приложение для анализа наиболее выгодного местопоожения открытия торговых точек”

### Группа: 10 - И - 1
### Электронная почта: cristgames123@gmail.com
### VK: https://vk.com/floweex

**[ НАЗВАНИЕ ПРОЕКТА ]**

“Приложение для анализа наиболее выгодного местопоожения открытия торговых точек”

**[ ПРОБЛЕМНОЕ ПОЛЕ ]**

Для малого и среднего бизнеса, ориентированного на открытие торговых точек, одним из важных критериев которого является выбор правильного местоположения. Удачный и правильныый выбор местоположение способно повысить доходы относительно других конкурентов. Одними из важных критериев для выбора местоположения открытия новой торговой точки являются: 1) Удалённость от конкурентов 2) Трафик/проходимость людей в непосредствнной близости торговой точки 3) плотност населения в области новой торговой точки. Заявляемый программный продукт нацелен на выявление наиболее эффективного местоположения торговых точек относительно ранее упомянутых критериев. 

**[ ЗАКАЗЧИК / ПОТЕНЦИАЛЬНАЯ АУДИТОРИЯ ]**

Юридические и физические лица, нацеленные на открытие или расширение собственного бизнеса путём поиска наиболее выгодного местоположения открытия торговых точек и иные объекты, которые могут требовать критерии, упомянутые выше. 

**[ АППАРАТНЫЕ ТРЕБОВАНИЯ ]**

Продукт разрабатывается под все известные браузеры, например, Chrome, Yandex, FireFox, Opera.

**[ ФУНКЦИОНАЛЬНЫЕ ТРЕБОВАНИЯ ]**

Программный продукт будет предоставлять следующие возможности:

* Указывать интересущий тип объектов
* Составлять симантическую базу, ориентированную на поиск нужных объектов
* Отображение наиболее выгодных областей для расположения объекта
* Отображение конкурентов по заданным критериям на карте
* Получение наиболее выгодног местоположения для открытия объекта
* Скачивание разлинчых отчётов для получения запрашиваемой информации в известных форматах(как минимум excel, csv и другие)
* Выбор тарифных планов и способов оплаты 

**[ ПОХОЖИЕ / АНАЛОГИЧНЫЕ ПРОДУКТЫ ]**

* Использование Яндекс-карт, Google-карт: неудобный поиск сразу по нескольким критериям одновременно, нет аналитики для выявления наиболее выгодного местоположения открытия торговой точки.
* ПОРТАЛ БИЗНЕС-НАВИГАТОРА МСП: нет указания конкретного выгодного местоположения для открытия торговой точки, а только указание примерной области, а также неясно на чём основывается анализ, недружелюбный интерфейс.

**[ ИНСТРУМЕНТЫ РАЗРАБОТКИ ]**

HTML / CSS / JS / Python – для разработки веб-версии.

**[ ЭТАПЫ РАЗРАБОТКИ ]**

* Разработка пользовательских сценариев
* Разработка технического заключения
* Проектирование интерфейса/составление гайд дизайна
* Построение структуры анализа
* Формировние API запросов к Яндекс.Картам с целью получения информации для анализа
* Написание серверной части для анализа
* Формировние базы данных, необходимых для проведения более качетвенного анализа, а также сбора информации
* Web-вёрстка страниц
* написание API запросов к серверу для вывода информации на страницу
* Тестирование, отладка
* Подготовка проекта к защите

**[ ВОЗМОЖНЫЕ РИСКИ ]**

* Невозможность наладить оплату различных пользовательских планов, интеграцию с платёжными системами
* Ограничение возможности API запросов к сторонним облачным сервисам
* Некачественная визуализация информации 
* Недостоверность общественных пользоваетльских данных или же её недостоверные источники
* Неправильная оценка стека технологий, которые мне необходимо изучить, как следствие – нехватка времени на изучение необходимых языков программирования, фреймворков и т. п.
